In [33]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
import lxml
import html5lib
from bs4 import BeautifulSoup

In [20]:
# open CSV file

In [4]:
pwd

'C:\\Users\\go27s\\OneDrive\\Desktop\\Udemy\\Python_for_Data_Science_and_Machine_Learning_Bootcamp'

In [6]:
pd.read_csv("example")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df = pd.read_csv("example")

In [10]:
df.to_csv("My_output", index=False)  # if index is True, it will create a new index

In [12]:
pd.read_csv("My_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [17]:
pd.read_excel("Excel_Sample.xlsx", sheet_name='Sheet1', index_col=None)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [18]:
df.to_excel("Excel_output.xlsx", sheet_name='NewSheet')

In [26]:
data = pd.read_html('https://en.wikipedia.org/wiki/List_of_banks_acquired_or_bankrupted_during_the_Great_Recession')

In [28]:
type(data)

list

In [31]:
data = data[0]

In [32]:
data

,Announcement date,Acquired company,Acquirer,Type of company acquired,"Value (USD, EUR and GBP)",Reference
0,"January 3, 2007",Ownit Mortgage Solutions,Chapter 11 bankruptcy and liquidation,Mortgage lender,NaN,NaN
1,"January 29, 2007",American Freedom Mortgage,Chapter 11 bankruptcy and liquidation,Mortgage lender,NaN,NaN
2,"February 21, 2007",First Merchant Bank,withdrawal of the concession,Offshore bank,NaN,[1]
3,"April 2, 2007",New Century,Chapter 11 bankruptcy and liquidation,Mortgage lender,NaN,[2]
4,"August 6, 2007",American Home Mortgage,Chapter 11 bankruptcy and liquidation,Mortgage lender,NaN,[3]
...,...,...,...,...,...,...
80,"November 23, 2011",PMI Group,State of Arizona,Insurance company,NaN,[79][80]
81,"April 27, 2012",Exportbank,Philippine Deposit Insurance Corporation,Commercial bank,"$18,000,000 (₱750,000,000)",NaN
82,"May 25, 2012",Bankia,Government of Spain,Savings and loan association,€1.9×1010,NaN
83,"June 11, 2012",FGIC,New York State Insurance Department,Insurance company,NaN,[81]
84,"June 30, 2012",Western German state Bank,Portigon Financial Services(legal successor),Landesbank,NaN,NaN

In [34]:
# Reading SQL, create sql engine depending on sql engine (mySQL, Postgre...)

In [35]:
# Create a temporary sqlite engine database that's running in memory

engine = create_engine('sqlite:///:memory:')

In [36]:
df.to_sql('my_table', engine)

4

In [37]:
sqldf = pd.read_sql('my_table', con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15